{"class_name": "Model", "config": {"name": "model_8", "layers": [{"name": "negative_samples", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 4, 1], "dtype": "float32", "sparse": false, "name": "negative_samples"}, "inbound_nodes": []}, {"name": "lambda_2010", "class_name": "Lambda", "config": {"name": "lambda_2010", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTExMy04MzlmZDdjZmEzNjY++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["negative_samples", 0, 0, {}]]]}, {"name": "lambda_2011", "class_name": "Lambda", "config": {"name": "lambda_2011", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTExMy04MzlmZDdjZmEzNjY++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2010", 0, 0, {}]]]}, {"name": "lambda_2036", "class_name": "Lambda", "config": {"name": "lambda_2036", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTExMy04MzlmZDdjZmEzNjY++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2010", 0, 1, {}]]]}, {"name": "lambda_2061", "class_name": "Lambda", "config": {"name": "lambda_2061", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTExMy04MzlmZDdjZmEzNjY++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2010", 0, 2, {}]]]}, {"name": "lambda_2086", "class_name": "Lambda", "config": {"name": "lambda_2086", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTExMy04MzlmZDdjZmEzNjY++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2010", 0, 3, {}]]]}, {"name": "lambda_2111", "class_name": "Lambda", "config": {"name": "lambda_2111", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTExMy04MzlmZDdjZmEzNjY++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2010", 0, 4, {}]]]}, {"name": "lambda_2136", "class_name": "Lambda", "config": {"name": "lambda_2136", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTExMy04MzlmZDdjZmEzNjY++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2010", 0, 5, {}]]]}, {"name": "lambda_2161", "class_name": "Lambda", "config": {"name": "lambda_2161", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTExMy04MzlmZDdjZmEzNjY++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2010", 0, 6, {}]]]}, {"name": "lambda_2186", "class_name": "Lambda", "config": {"name": "lambda_2186", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTExMy04MzlmZDdjZmEzNjY++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2010", 0, 7, {}]]]}, {"name": "lambda_2211", "class_name": "Lambda", "config": {"name": "lambda_2211", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTExMy04MzlmZDdjZmEzNjY++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2010", 0, 8, {}]]]}, {"name": "lambda_2236", "class_name": "Lambda", "config": {"name": "lambda_2236", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTExMy04MzlmZDdjZmEzNjY++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2010", 0, 9, {}]]]}, {"name": "entity_embedding_0", "class_name": "Embedding", "config": {"name": "entity_embedding_0", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 10, "output_dim": 256, "embeddings_initializer": {"class_name": "Constant", "config": {"value": [[0.313688305349638, 0.2473345686513071, 0.03843726043294793, 0.6195571309231465, 0.9767671473789469, 0.3381707732660134, 0.3151492826366389, 0.9720905197368437, 0.3718373669330085, 0.4509882764022859, 0.5560277372187474, 0.9290796185961573, 0.7163997681752138, 0.22073499810918595, 0.394821820005252, 0.10697468779266017, 0.5635395174105947, 0.8143819173159305, 0.29002428139961467, 0.46178945726261345, 0.8635748336675934, 0.27230009232786023, 0.721725437641725, 0.4029987352076685, 0.36575704203000625, 0.3021007915238041, 0.5797199026067251, 0.8130951229037373, 0.8268689413070468, 0.6353567599987909, 0.5350202013550645, 0.4820371900698043, 0.11197514481582627, 0.7382951650360152, 0.8096830630923751, 0.6136502642257105, 0.9395519162024265, 0.46579232597844666, 0.7458898289208143, 0.11047299144659206, 0.7135428283010714, 0.913535048615997, 0.948763020591022, 0.6150162168937136, 0.821158483856843, 0.8651781583248637, 0.2738629186534093, 0.2057884739425655, 0.09159595684648536, 0.05880434824290193, 0.2428759805767774, 0.6304719841190997, 0.22564315913910593, 0.5289223020167393, 0.04474329014287659, 0.04972848852164835, 0.09502361379781443, 0.3782235808475217, 0.19126226470857433, 0.3103183261365363, 0.326869353029015, 0.9376098914261844, 0.2454096727749957, 0.6528633278083945, 0.42519852771754285, 0.3830689486288842, 0.09445370031929201, 0.7381299704523897, 0.8583798158088796, 0.9669904032555117, 0.32540630858307806, 0.36970786231888375, 0.9905092071696581, 0.1275063880990085, 0.5426786761443236, 0.17092781408951174, 0.3087721365425291, 0.8051696563040195, 0.7552751328306269, 0.9932433302975519, 0.16535105626818347, 0.19286021652177465, 0.8259216125676826, 0.5195465960207238, 0.876882137996288, 0.5830142984148945, 0.8544596168423529, 0.7610376475313162, 0.5973909847943056, 0.768929503453402, 0.7746331575648048, 0.08384879482504104, 0.6247079804722586, 0.43724052160762994, 0.43693270348385893, 0.3141403783180342, 0.6872325288465859, 0.07652175801567052, 0.3000306097013792, 0.038134167525601725, 0.53904257307655, 0.9069442030771884, 0.6838903640414836, 0.5184198191681457, 0.3938604850754901, 0.0015289797470393607, 0.5288474492131511, 0.1325247708553431, 0.8647292631025675, 0.9054151791761329, 0.029684813210071104, 0.6005105663226581, 0.703287788207909, 0.8274991730517363, 0.5369013142529151, 0.7604179272028695, 0.4364702316764618, 0.24341959132062496, 0.49105673474467937, 0.03902823943450173, 0.8498983923237493, 0.5968300001422339, 0.5181768771770044, 0.221220443738245, 0.6014354101371922, 0.6798727930330786, 0.6982437983842714, 0.40493859024803025, 0.7208058193267965, 0.6541909048757883, 0.47835847668821674, 0.6378799767142345, 0.8181156385384624, 0.3082080215063906, 0.8117920243154283, 0.34213123483987695, 0.4791912015645867, 0.0960718967015931, 0.48474511204504644, 0.23317700826774368, 0.07726432725290044, 0.8915220254765156, 0.36790255128417815, 0.47325108320721365, 0.2737627063246342, 0.40718038247622024, 0.9945949588952473, 0.5876453339147187, 0.9751893785264952, 0.07239559019175024, 0.46220553737924863, 0.29656831010897744, 0.4952558192166312, 0.8713075157217344, 0.20162915533630543, 0.15185057897946264, 0.23053246587157872, 0.349514628881501, 0.32035954900378405, 0.14155950305935372, 0.4346706079500883, 0.4475604027770983, 0.7983220549324822, 0.04021223621030379, 0.723644223816486, 0.9250926604061037, 0.11890455428471036, 0.32242563977214644, 0.31853212491581584, 0.676113330578683, 0.2779319295609204, 0.3512084726772323, 0.8455824915516968, 0.7054515501605824, 0.28556319038024014, 0.4105209003144543, 0.604722590183299, 0.12431058332810752, 0.8315477425751603, 0.2082200890610879, 0.20236707903118756, 0.24214666692154407, 0.6630812873539984, 0.48062279700664845, 0.4446843349682318, 0.6574588089111348, 0.7803243335470003, 0.22637040927809127, 0.04319091197552383, 0.09966788726787512, 0.7128924163015414, 0.6186584132493231, 0.8594781468137198, 0.2128601884602278, 0.8162960465102789, 0.8509378725440756, 0.28543711024863005, 0.7118370397412517, 0.4136415322182917, 0.29314520547650147, 0.0008275589428320407, 0.6846939876878639, 0.9479478985652154, 0.6207238842650946, 0.9189890221146712, 0.7255156383361934, 0.009571241187015689, 0.9579405227959101, 0.9569012388224478, 0.9944695898751276, 0.1865287070042363, 0.6679798296603878, 0.48523303919345306, 0.6485174582953444, 0.6685294083678284, 0.018586162469584555, 0.13363650267594984, 0.5276450800727177, 0.7029318589167165, 0.5779588824992135, 0.665453619306659, 0.6051665476235036, 0.8194471585948524, 0.9655788113750194, 0.9591892747991815, 0.603977165524378, 0.6162550383520328, 0.5923719593008964, 0.7528795322923385, 0.37413949607370245, 0.14005502884175258, 0.17738753988121703, 0.4474545099180913, 0.5299488851460242, 0.29761156650554876, 0.30000915804072636, 0.32760759497542047, 0.31404014242248557, 0.36027020323871906, 0.3597565150173162, 0.6643459728427994, 0.6026345485183513, 0.045613107521250584, 0.6911398500663748, 0.6843921170566098, 0.771574286298305, 0.27852104639060726, 0.5032248419331725, 0.33671622302451976, 0.3834080514144136, 0.3515031531321515, 0.7958137158421381, 0.6689956512096855, 0.34436476999566357, 0.060095378027153146, 0.08222311547514416], [0.294429658951718, 0.8030078835441959, 0.39705552282484147, 0.14459887378527636, 0.5812474974075118, 0.1287873296433929, 0.5781074393570963, 0.4702993877417494, 0.9270075091761911, 0.6551717335138466, 0.6379282693155754, 0.3106901329907309, 0.61784360301961, 0.06599565157467246, 0.813586698152128, 0.5077855043857156, 0.29382642014807137, 0.970879392545774, 0.5605320845782972, 0.4886378933695995, 0.2177984351166553, 0.16543796082633655, 0.10009821695148924, 0.9834619977226209, 0.052214932633240174, 0.11000210929728194, 0.021518612853723806, 0.42996541770135743, 0.9723036995760567, 0.1576839532646015, 0.4134939439866847, 0.540107760353931, 0.9745274940818334, 0.6159383684262318, 0.2806513870973454, 0.0009449595578956416, 0.7727193992534813, 0.7968688407700562, 0.9194288120238115, 0.8461260336004064, 0.711210311517072, 0.47977401632475436, 0.07465285836130742, 0.15301424957688614, 0.34344367540625753, 0.023248696063458474, 0.147827624346053, 0.5781714624476012, 0.22592204498248059, 0.9053172873558661, 0.7868017379030157, 0.35306278615520437, 0.7112763154264783, 0.13435510764195702, 0.22540264277938427, 0.24653609080729655, 0.06089564609524045, 0.8469593459460101, 0.18551924242043594, 0.5944051638749296, 0.818081167243298, 0.2556587816157543, 0.805846526007286, 0.4328920144639703, 0.22986845537420542, 0.6507048767330789, 0.6481785729973191, 0.9187323062093664, 0.4588571497949143, 0.3358089589918549, 0.11106361268742693, 0.6104790329879378, 0.019813509366049642, 0.14374300031618426, 0.27228805073589013, 0.6103078518795941, 0.6857857287822715, 0.10074216130283531, 0.5909659440964374, 0.6204467816612574, 0.3170882516715573, 0.057125270170636955, 0.017320310010025097, 0.5526241180093564, 0.028883379705037737, 0.33901344637999176, 0.2833005396303282, 0.1648665029604789, 0.2121704696274076, 0.40555003204419116, 0.9493990223843909, 0.6034216132294328, 0.7590009442641541, 0.0455115973309238, 0.17253843747064013, 0.5061556414197792, 0.8272041567935562, 0.9704160473058552, 0.43843957173981807, 0.45279849104558656, 0.22068667899268912, 0.9268606507156711, 0.6106875907154684, 0.6069040981813709, 0.6807237600974502, 0.1792807832581329, 0.020945898906263083, 0.015100555186228326, 0.9023531562418436, 0.21149382963438745, 0.7721025388993833, 0.5389176476349693, 0.9503573871134979, 0.2563235440262752, 0.9758706127600462, 0.8110757073841182, 0.7542450105452917, 0.7506594604157225, 0.5143460285338335, 0.4850246892040091, 0.9846111332137697, 0.8725750473126517, 0.9480394984106659, 0.3016859759195175, 0.2024935266275001, 0.4988989415414522, 0.9866002532110087, 0.2001420552763532, 0.8392171877833212, 0.7173371124763472, 0.008295441847685603, 0.9982779919683342, 0.995244661456431, 0.4706559036090281, 0.7356348135056844, 0.6865553027085851, 0.802594536160112, 0.5318381342846578, 0.6450004546982939, 0.7004199113571388, 0.7006440212216589, 0.9965938771730943, 0.8797903548596026, 0.5966888512750163, 0.664116556890279, 0.3228793918465631, 0.2786001078522291, 0.9108605503518178, 0.6229380531486964, 0.13116157780054383, 0.05778028572540839, 0.19912670298505242, 0.7092632378298571, 0.17646189238611254, 0.7088389399851424, 0.6855132075500313, 0.9044448760760527, 0.5947057184829238, 0.9425063974412117, 0.6048460367144021, 0.902227228213496, 0.2820082482730524, 0.4718198624426969, 0.6709465497632887, 0.6180710949383309, 0.8170451184663784, 0.539882892842791, 0.6745612091144155, 0.11370160806526952, 0.2724045843053462, 0.24764761650973344, 0.5307423673871797, 0.010435231440932391, 0.10110216949289164, 0.04082051155759603, 0.5330266703197765, 0.9089232820161396, 0.4890330653315854, 0.22909584618547973, 0.6846856087380035, 0.6944260735293059, 0.008755681939430549, 0.5229193783684494, 0.08073495217567694, 0.939647382686686, 0.760588447757084, 0.8978404612226697, 0.8860691644647952, 0.257219420888422, 0.2383383742612719, 0.7611997805911446, 0.09678076682582626, 0.4490930568902809, 0.15603428488745286, 0.13530193803297275, 0.8759209697174364, 0.750151764956433, 0.45986074322935433, 0.5303032916869354, 0.4006708634404237, 0.6696613811032468, 0.057497993775966316, 0.29933388125453697, 0.44990843028470084, 0.9840474349255627, 0.4724711638153568, 0.5052759696767806, 0.8129642247670384, 0.5876517998470908, 0.42906336898532227, 0.5731030778324578, 0.4566013580979055, 0.2628764689329215, 0.2672396258239085, 0.14455925371628742, 0.6583987264199059, 0.025781868545527664, 0.9064599902903272, 0.08997113003641255, 0.6280342261245171, 0.6255861618503806, 0.2817546436529219, 0.4463155922901837, 0.6113545095284931, 0.6587603760595689, 0.34201088985813444, 0.8278903005216417, 0.972740816319923, 0.9883587676809243, 0.8835768045082405, 0.6462712425894417, 0.7332387673961617, 0.2661399749537283, 0.8059187065294068, 0.763029992293945, 0.35706548922230685, 0.9461080310343637, 0.21515307526919603, 0.2846624676990489, 0.7539612340996337, 0.06797547060821096, 0.3787249644871864, 0.986108163140833, 0.18284121857172242, 0.738680575911476, 0.8838451252055498, 0.642104526785347, 0.7573482433234988, 0.12413963870105771, 0.5775176880379407, 0.9170536791083347, 0.9366071758221758, 0.8340203292010415, 0.9209705428854498, 0.31182314976194025, 0.2872717859201991], [0.6762584283932317, 0.6830441833277727, 0.4575327061166221, 0.6074736922231976, 0.10746444201112337, 0.1231214100279946, 0.9770351955295531, 0.2999481226166051, 0.6532287211733915, 0.6665513410515599, 0.3553780660368717, 0.7655889143513371, 0.9643450558162875, 0.6558348079153155, 0.36837106257020014, 0.744115788523209, 0.352545598115516, 0.6133029114519809, 0.1344286583597044, 0.6198081173448328, 0.7078891777105633, 0.433662370207594, 0.7381301605375538, 0.7899090686116249, 0.9464242356643296, 0.20464431115353077, 0.16771986130106153, 0.1756907258375795, 0.7856954476445092, 0.8716657367188176, 0.8403753489849779, 0.15926219967342503, 0.5548275212300385, 0.7572371452194913, 0.9824345522744409, 0.19840626007469853, 0.08494545624290617, 0.6024041124964777, 0.6437976571052254, 0.23595246142746507, 0.6417216306594636, 0.8726238824411013, 0.252511602480641, 0.9150795649591499, 0.6735612399826433, 0.5613405051821594, 0.3174979348628547, 0.22821527927205065, 0.9431385655116847, 0.1587894265034968, 0.3849426440921132, 0.5780038737155482, 0.3264643465344469, 0.3786098635614724, 0.3232058954306165, 0.4794640867042572, 0.7746245010600934, 0.3016466506345268, 0.02012660715300918, 0.8782793549505471, 0.09993121887943557, 0.625655181991028, 0.05011058320041162, 0.3257609738923489, 0.04322236079472552, 0.7070170462881062, 0.7414539383360931, 0.9307637142565609, 0.36339443746738187, 0.40218215623794673, 0.4715891035693165, 0.4711658434666196, 0.7011563700048393, 0.19899412320172327, 0.7229415627400989, 0.8727363311899898, 0.8753494542112068, 0.217925885288749, 0.3947077229237146, 0.10225111026503486, 0.4488944902480061, 0.6343517696935539, 0.7929008959419384, 0.8424441083390652, 0.5730512875137564, 0.6394408122537214, 0.5703551562728895, 0.2992892009025676, 0.26753579100901415, 0.3596093000718804, 0.09197859339653369, 0.8491836710344494, 0.4688037378867479, 0.7203884091759845, 0.8788523936599536, 0.401086324311967, 0.016901175236883725, 0.2419811317701721, 0.549510175039332, 0.7143671620350582, 0.9864443571797186, 0.38894754402567444, 0.10637132790544912, 0.291103225314834, 0.742629963545481, 0.4040800655048662, 0.5492022968079548, 0.16737786636071184, 0.13331453363663848, 0.10195564848407379, 0.9606711730920006, 0.770881964354406, 0.32720900018635224, 0.4849560700978307, 0.7131441983306986, 0.3247861829871901, 0.05273037327117913, 0.5834473234251671, 0.4339433486220109, 0.5054458193280513, 0.9070554499575514, 0.8581272159835439, 0.2829725240189006, 0.38105180382616133, 0.9784156959572887, 0.9678606241223793, 0.9512809342556083, 0.16984711691252852, 0.4650093420362249, 0.5522017530717205, 0.5957427573081732, 0.7670288264763557, 0.9374046763566519, 0.613532422403298, 0.9295404365407929, 0.006874245191433426, 0.360834566543055, 0.8642150970940883, 0.188581480266252, 0.785950125776174, 0.7735827387058142, 0.21173107606517538, 0.7163629417354699, 0.06838601470867345, 0.5955286196345764, 0.31129064205060564, 0.7855703923646992, 0.06448392068775244, 0.5033056521407215, 0.5805755792923754, 0.8183126100653378, 0.8969437469738837, 0.4348274628620773, 0.09044243369572091, 0.7691803791099353, 0.02120737492043978, 0.9845531989660765, 0.6701570810239842, 0.9895252408001131, 0.28857573488638677, 0.7208233571384998, 0.23662221052789523, 0.8538984172147358, 0.9444892191508905, 0.8154178330196302, 0.8723913968551014, 0.9879741596681366, 0.20515170467154997, 0.3906814725916927, 0.7314768068558217, 0.9790609003174083, 0.3087271414387527, 0.3072263972986763, 0.7927567234861643, 0.46222128726875045, 0.3984567414336726, 0.12276748851377939, 0.7741856653255675, 0.44938323793769375, 0.08633981182573347, 0.9970750150928943, 0.16423632084597284, 0.5241009041195402, 0.8436155177354236, 0.6138181611168971, 0.3223532410543377, 0.9325466949175328, 0.18422775100040856, 0.021428343498385294, 0.5984894763122485, 0.05240091180708695, 0.21326995525872627, 0.1614163069621367, 0.2638793119004712, 0.024212077663069653, 0.20907912986025667, 0.22293483743354536, 0.572684754528301, 0.5499359927292444, 0.7905528750104606, 0.9132636008345612, 0.011149815203255975, 0.8327034888813224, 0.8916077344666515, 0.17827846907548706, 0.5447857629258891, 0.4826550965061791, 0.805091365417042, 0.23780058369779833, 0.9763711184319781, 0.5679331366194853, 0.2720780325103713, 0.535497829036502, 0.2824318761193966, 0.235468570373482, 0.4588176593716735, 0.9420916385126042, 0.7415659068802977, 0.2360251239434551, 0.7683421628174962, 0.8295924447720145, 0.41134488445850914, 0.5634726418066892, 0.9063027400150963, 0.9031999618143592, 0.15798504097733745, 0.9254181758303421, 0.9737880396224097, 0.7824263614548761, 0.7040754848959286, 0.3605028845157072, 0.5126207183366979, 0.17243685064723613, 0.1840329733703444, 0.20230627695337877, 0.906491850545647, 0.16642281327129227, 0.2970587786074602, 0.03658833486123669, 0.294705175479963, 0.22481909653331433, 0.0974335413060009, 0.29703735809005016, 0.21383229876975873, 0.299036122494341, 0.6510464008248897, 0.7842797561020791, 0.9096402332397495, 0.2885804497233193, 0.020395397633864665, 0.9171667050166505, 0.46750678885905494, 0.42496427432997197, 0.4051950823930872, 0.12364572980549482, 0.23440120583025936], [0.65098954077144, 0.2867394465909988, 0.6316051799353904, 0.6755435299339327, 0.7871390540811662, 0.20665349634844432, 0.42506665634328034, 0.5908397231238584, 0.20579307372123035, 0.3722758003664596, 0.3558011857757136, 0.20354316885110257, 0.19722847710696256, 0.08756399465406284, 0.81258242140765, 0.6220352742367882, 0.33244556953383964, 0.5408636049947807, 0.15932242270269215, 0.2844330191827755, 0.9020753894205483, 0.9286207278350571, 0.15918996287741805, 0.4293514097012142, 0.4030974044372104, 0.062236305462860186, 0.6300113174442272, 0.7726339527029369, 0.2818021064902728, 0.939968926177609, 0.5810590115110357, 0.41200733747506424, 0.6959771859239201, 0.3302117249096783, 0.3647484206448597, 0.698213845667724, 0.3883704909335971, 0.07717776337645343, 0.2789289152557932, 0.019081133323045507, 0.8916481688489919, 0.4434139666660547, 0.25927024534319676, 0.153803407669153, 0.21131753150878496, 0.6536854968934886, 0.3201573469324105, 0.4933342830462174, 0.6491980137108039, 0.04584784542384135, 0.5361443808256545, 0.7376079206864168, 0.2656132708753074, 0.13501589787848112, 0.8873335677157137, 0.7040745439644447, 0.04185569724773108, 0.791090428476438, 0.3011705285218417, 0.22988698312591394, 0.8031301014669093, 0.8625497819468558, 0.5898649026457838, 0.3621374430804819, 0.30259797727927196, 0.8298068010583749, 0.30200170711014573, 0.4538448153967496, 0.7247447174044146, 0.6185270892908822, 0.002027653051032252, 0.14795904806558058, 0.0996238639267728, 0.3644624321895974, 0.20148677704709894, 0.09687440637390998, 0.3407529685138254, 0.2594220763792212, 0.7877575816892203, 0.38809175195551604, 0.07377806305847456, 0.16385665201405597, 0.6011842109294994, 0.6977953641656199, 0.9195415634588692, 0.5536556886341072, 0.9357759980514346, 0.10221723804690364, 0.12367665950463114, 0.03219845898406648, 0.9784850947399124, 0.020246848579319576, 0.725804071505972, 0.2851342645189756, 0.9242054788888455, 0.19710491613212544, 0.9660054987507636, 0.7474966936511787, 0.8439652278304409, 0.030647496979627098, 0.2854618737004455, 0.24582550185006558, 0.22468830806397488, 0.42473066180807206, 0.9383461199393875, 0.8558010358986176, 0.5191221792638181, 0.9975598495095434, 0.5660877433325928, 0.46459107686087087, 0.6053005835688995, 0.8719246326423312, 0.9801082547189717, 0.5435909517310082, 0.10404883103690865, 0.21793120226699692, 0.9327935757259078, 0.9925626329756587, 0.9475555927893679, 0.45866964508314545, 0.7060066181401228, 0.779360148300694, 0.9356312379540943, 0.8471299160155261, 0.143785684278941, 0.02298664658068228, 0.1839531182966977, 0.9191350440920268, 0.2681159413245372, 0.18649944550332254, 0.294221795840254, 0.7914391425516877, 0.43363266379566756, 0.991974339396972, 0.3525657460451983, 0.19862237500009317, 0.13926918803573385, 0.38362318084259317, 0.025200127353147583, 0.7810282423593506, 0.8253358971296302, 0.8917559962591269, 0.4180608406178489, 0.4596421808193868, 0.9872597200473201, 0.9013174024225836, 0.46254636022247875, 0.8148028801582016, 0.7490410219726518, 0.8511546843171779, 0.5911678312892352, 0.44841880974360726, 0.23575142175075692, 0.8656455997433977, 0.8666231775245529, 0.5557518010888342, 0.5345454668859607, 0.2035498264682959, 0.7199549010447871, 0.27602479425417503, 0.33832581262227124, 0.41947341529776083, 0.553884559187511, 0.7660773752280143, 0.36232884941700005, 0.09812876986911123, 0.35840641843423793, 0.9334539444560894, 0.7247306239833899, 0.8194444021500211, 0.9787258677252128, 0.3687421184116517, 0.8949088292622942, 0.0722702799903806, 0.6838096592957729, 0.07331617808623248, 0.5312336265191688, 0.7225302531711303, 0.38221395292233096, 0.03317364094423347, 0.024592619066736154, 0.6179333752826498, 0.05271363625651071, 0.9852780022291757, 0.8882730913990832, 0.9392376521678051, 0.9485472902808758, 0.7885752759855506, 0.17820345852543862, 0.5867717259283205, 0.8427722698867275, 0.08170623183086922, 0.4033165857771702, 0.0066355207376623815, 0.005668160916788123, 0.9394061820935844, 0.0604558933317243, 0.20653599374555986, 0.49995319616343004, 0.14659160398965132, 0.44150507072961853, 0.9891964572709803, 0.5048053668379874, 0.7524088535871921, 0.725857050263979, 0.2572380784853707, 0.7990660255620855, 0.9630621528693197, 0.25792388473492567, 0.5313386676548977, 0.07263146159623035, 0.3239566959822192, 0.13126790061981386, 0.3367177428791015, 0.8512429011566577, 0.48364664303943594, 0.641951400680875, 0.6273107343034774, 0.5025716742099529, 0.1043624899591471, 0.038485002421814296, 0.5067108813476363, 0.23811972577224483, 0.06253215234837295, 0.693762766582184, 0.8296303034583515, 0.1728707618857055, 0.2516652112428841, 0.11833346656173072, 0.27684484397557174, 0.4608751849548842, 0.12504712074797486, 0.7002495894850599, 0.8106061347598124, 0.3916394292770047, 0.6400567142160098, 0.055634090718992946, 0.4587817173512372, 0.25833900459350345, 0.7960254137643946, 0.30537221851251073, 0.5439316370929442, 0.09485694839701242, 0.3858330073435159, 0.7025334026825321, 0.9125497878462338, 0.4554451219565806, 0.3892432028959475, 0.4600266662181268, 0.3907211727901856, 0.5462327865101051, 0.8253448810171341, 0.8166158289284036, 0.4028235410048717, 0.07764179289301676, 0.6796026348130121], [0.16005240639623297, 0.30458798624617134, 0.7137661221900466, 0.44726967669303075, 0.22765602264912332, 0.06536941837471433, 0.10438137003060532, 0.3793562753650166, 0.9263256443934329, 0.5678444114272226, 0.34542015345104016, 0.9539404841537903, 0.7510241005237969, 0.013386952058366486, 0.24669573316462212, 0.23576966684057998, 0.33912619515726605, 0.934028042484341, 0.20627879789266068, 0.7069543759527389, 0.06956906768571702, 0.41123219342793327, 0.1218096473157364, 0.6389194800175412, 0.2619817368878755, 0.4399199845018248, 0.5319422317035984, 0.2409770490158306, 0.4121737799478623, 0.12597749943710423, 0.9330082009334075, 0.22321108924359145, 0.37219874976973866, 0.6222905126268096, 0.5498901578881772, 0.5901607051445212, 0.8244265980373571, 0.6986440682256287, 0.21143585954564992, 0.7899807131164535, 0.4074784016819266, 0.40779629598963596, 0.3029021491558357, 0.5416313245824701, 0.53173289815096, 0.4341442028888679, 0.0598088772507539, 0.2803336112184388, 0.7040470898341306, 0.9836793970191793, 0.8228087932214719, 0.802044769385415, 0.15210516173775623, 0.8826411333969355, 0.1561212151799155, 0.4251213929241895, 0.5167650264182125, 0.9481737234328903, 0.7765934577081303, 0.978330448442128, 0.31926046378032114, 0.6437731001034804, 0.5725067149468135, 0.01637591997249932, 0.18030315368905014, 0.23860457694595194, 0.44257504039485596, 0.5083021328902972, 0.31743507442625074, 0.28506916368935664, 0.2937566627628482, 0.04535279645328416, 0.2710118349253682, 0.8323785262203263, 0.8082946980166277, 0.11607905890121661, 0.6072923291088943, 0.15619892226251064, 0.2532098630015164, 0.3324616147947894, 0.47491426795800185, 0.7972033980002207, 0.47529122423000614, 0.5299471646624806, 0.18254389302918084, 0.6566061073191745, 0.6381189784576636, 0.031167903696838528, 0.8344752782429259, 0.7418236494104051, 0.13088486780985065, 0.3345251763785261, 0.6774057633410966, 0.9543745205492928, 0.49116137583739083, 0.9133414648092452, 0.08526433245618081, 0.6404919396700447, 0.9019093895732949, 0.7703952459895534, 0.8063189939427402, 0.6902200557207196, 0.10085027106021938, 0.645963422074135, 0.8441561056366063, 0.6760910839730174, 0.020590761495279386, 0.6511005178331226, 0.255421388364546, 0.27829972471300657, 0.2601879310432069, 0.5479006430475784, 0.9825778870945233, 0.8611541613238569, 0.8719176981168106, 0.5521347879356003, 0.6347238133299883, 0.35900928643542085, 0.30713766915858864, 0.15755741259318767, 0.5757600536630105, 0.23021942796541195, 0.5739709806305665, 0.21429724981075715, 0.2724031818340791, 0.8494670061988242, 0.38433825239425345, 0.8441924827014138, 0.8396568292459538, 0.9670192080023102, 0.9189156926438556, 0.4212700810707244, 0.7593494667816679, 0.5980827004641361, 0.0730447689900513, 0.94539705019219, 0.27128633933280366, 0.9207999668214873, 0.7524078567359596, 0.7082884640766773, 0.26765402148881745, 0.8347607317699633, 0.0749358885217859, 0.3068512792365541, 0.9226221824588282, 0.9557118430558468, 0.8217127104376492, 0.7896016306125091, 0.5482317656000226, 0.5393448479963736, 0.9347602729311079, 0.149236532044827, 0.3418809471345641, 0.2720845497066975, 0.8289763980338949, 0.7316508027401327, 0.5820038050534947, 0.7940724184405963, 0.826688301201575, 0.5047142816830046, 0.993151066569816, 0.39119621265110105, 0.7303783463883811, 0.23401342136739922, 0.018587460143497103, 0.1852725906556082, 0.38397313365464214, 0.4124508761457347, 0.5839244913944958, 0.18530611481156745, 0.03866844654906443, 0.36113291635283673, 0.2518674007521383, 0.07495675932074186, 0.7935605515626707, 0.9075654652411556, 0.9783804393366677, 0.44846462642298335, 0.7078111114508959, 0.450833446830215, 0.7465175976449357, 0.1047726784673364, 0.433236068048679, 0.5080148681804613, 0.3887164381227366, 0.6570962874553503, 0.5584264161820353, 0.11665557402163196, 0.8981682087009696, 0.06078753848682761, 0.15544995981610588, 0.5737303653509509, 0.3345458497313144, 0.05708480142049854, 0.7696681497887091, 0.37533201676298533, 0.16852670295931838, 0.15691721332673714, 0.5350189505633796, 0.17453954351045586, 0.05430732976747865, 0.8735574440621626, 0.9000156372975292, 0.3564762010294078, 0.6854044740382115, 0.7402355421381343, 0.6281008473223949, 0.41151248081501934, 0.7182896389397345, 0.23858470068511028, 0.40820011397190503, 0.005964581056737472, 0.9786120987288972, 0.8452979627422413, 0.8558002537281849, 0.8877272949937143, 0.3584255882365738, 0.4037349702957095, 0.4500144990340057, 0.8254666890086658, 0.7505386523105664, 0.19773407578675262, 0.4724475348290651, 0.2455202693874684, 0.5197000632410934, 0.26942713301237786, 0.713618235219857, 0.7982023924110935, 0.35670275070784563, 0.6781171950432242, 0.6565556905137402, 0.6150231987423934, 0.2355428664485959, 0.8999199464220177, 0.9759999385061983, 0.39168206626335034, 0.06795511149509659, 0.5167620743214727, 0.7304069121607746, 0.08138290955519267, 0.2502403426176657, 0.29159258765781926, 0.3408533226902478, 0.6728086034768681, 0.11076034178269378, 0.9264350331350311, 0.5606392860678802, 0.510845315588665, 0.9850143856561324, 0.5845245216819577, 0.3493173540818786, 0.41362120884652376, 0.2677193844840384, 0.9733992548305074, 0.69008469536239, 0.7077976970195672], [0.7859844182823187, 0.3586627869565927, 0.14139176370825346, 0.4250034010956186, 0.6996432354335769, 0.9491453555817808, 0.49398008163122864, 0.18658134974350438, 0.8284697516420415, 0.22749163108333115, 0.1815242958287474, 0.044601288593430266, 0.10674670604094616, 0.5699155548000661, 0.04075515689527909, 0.0869132172782201, 0.7545430888213509, 0.2777133808845218, 0.36917067709742046, 0.137058895511867, 0.3266805490918421, 0.2984354648646159, 0.8196371528378646, 0.3185004004176777, 0.5408794587052304, 0.8080193464052261, 0.9182364426369787, 0.5127060049751551, 0.4816613887175464, 0.6577836483500903, 0.7887889803608645, 0.3732868134313563, 0.16929994625510614, 0.9362663306562526, 0.8594947402764012, 0.9668335142953554, 0.38272716287081365, 0.21588189435759753, 0.03161480557484797, 0.37398423729917196, 0.2890239991617043, 0.3147353657525599, 0.6321595884631678, 0.15154817918670616, 0.3339622739953819, 0.4956105529688023, 0.04307850202823893, 0.3163986607398611, 0.8575384010521475, 0.9927497196939318, 0.380949827918845, 0.33784795292559633, 0.9148384202581276, 0.2905318878822596, 0.1300249223570591, 0.316197058343179, 0.8869354586936908, 0.8492969127354636, 0.6416385947710455, 0.9336480273520388, 0.029160084622873006, 0.2084378758546478, 0.9818003206410689, 0.29779238494618165, 0.6220167386190889, 0.39960129206011785, 0.43639310080917626, 0.4061719785963799, 0.5578081152771213, 0.4583056217626357, 0.2041042743571242, 0.9148192078256708, 0.6427731029365749, 0.20555680065427873, 0.45006545506751006, 0.9280828637155174, 0.4647387186886641, 0.8263953008026056, 0.32999335621531134, 0.5798680356252766, 0.6362983709722083, 0.27692606051264224, 0.3930743579930799, 0.24760577327158695, 0.1552147118790802, 0.9135603733289558, 0.3176078909307132, 0.41051519792919433, 0.051725550551243504, 0.4134993981034971, 0.7490530314204924, 0.27959867861632715, 0.17439893883745006, 0.3135157196139705, 0.8231830993722563, 0.36648277025814124, 0.7755415232050109, 0.8227640692576643, 0.6118787673185268, 0.32410265044037134, 0.9026279933923527, 0.09793642188418661, 0.3634395094019086, 0.02261486352774722, 0.2230208448576967, 0.8780350175235053, 0.9248884629695913, 0.4740719392782359, 0.09622758444393964, 0.7472208099535825, 0.3598249798353532, 0.7295771981879045, 0.9727908522321815, 0.056714869375659616, 0.9489013576868289, 0.6484388038755181, 0.9452569719200605, 0.46599810337535297, 0.8468303580634818, 0.2625981091247479, 0.6839387976346027, 0.45018358018711546, 0.6267050173095396, 0.8793574003255766, 0.35772531320651757, 0.7856829201093709, 0.41270306365815734, 0.3647919843092656, 0.03813001683899897, 0.7876211758798431, 0.014564198580783283, 0.25175576083824414, 0.9190451201760872, 0.4031831649759351, 0.21505694053937607, 0.6502348079423074, 0.26805791311335303, 0.5185496935855463, 0.9861620014807704, 0.707341787992908, 0.8284671547383953, 0.9235238918732511, 0.9259953641722504, 0.9668032784616204, 0.6100277271867275, 0.7944957441669016, 0.3230377050538822, 0.7717392294522062, 0.4084812532268467, 0.7029219264811974, 0.16823194350049653, 0.38808292628792596, 0.4952318009633945, 0.7296949251316515, 0.35662128759533596, 0.8851683193302834, 0.3332779650511607, 0.4005555656109254, 0.7043844558589217, 0.19751843079405818, 0.8225418686833155, 0.5941241604106099, 0.3408957745311666, 0.4743656836219535, 0.41894634319205903, 0.8992902099601648, 0.69538359407601, 0.9612120545029846, 0.002232705495568754, 0.9469330503766283, 0.1165030408259966, 0.5973286423071587, 0.851122603040575, 0.4235883240219602, 0.41416673479077903, 0.7465312411207174, 0.07060131967905348, 0.8872697646019104, 0.6425709168211974, 0.06824261664992914, 0.6657820398371345, 0.42722646804382824, 0.008735787350844237, 0.8029270192455302, 0.37597018950073713, 0.5523776459375012, 0.8941065855503714, 0.6420493511760529, 0.5745822203609895, 0.24337630035676872, 0.572284112522045, 0.7943920995811545, 0.711096324303812, 0.5375974586860202, 0.6547342065605246, 0.45878094113254064, 0.5832753642972179, 0.9790151835409233, 0.7560398219391887, 0.3139846669094237, 0.10197298211724115, 0.013582028171498006, 0.3950717475587534, 0.423184432547141, 0.4376702345142419, 0.7208529634439856, 0.16332419450290325, 0.5847432989175573, 0.635032019122452, 0.4792727201194583, 0.6473404791566415, 0.924094612393904, 0.27503742395315356, 0.8027958269538649, 0.688300905257504, 0.7548657064695633, 0.8000439879555591, 0.41658707538733764, 0.5963261653813056, 0.7316546688920823, 0.4791380294636014, 0.33531049571120464, 0.487018650740471, 0.9265134591110747, 0.5820598017857181, 0.9010359455443114, 0.4315004086096066, 0.6621244465051769, 0.5478949553169526, 0.1718377436788071, 0.3103986265717782, 0.44290341171880565, 0.9269431885910064, 0.1759391843481759, 0.6685947340542003, 0.3724200690121684, 0.7100991145623329, 0.89772268824757, 0.7440268888858094, 0.2696005689313219, 0.4811144403341304, 0.591065438848303, 0.019006604028843577, 0.6272824766284671, 0.5443591855307608, 0.39681432871399236, 0.34039279028500247, 0.6578662533303866, 0.08745218192905058, 0.6642051991093846, 0.6038034211192898, 0.8244327598327449, 0.24140761666930888, 0.550000056652376, 0.12368148689602931, 0.022959977992556446], [0.014828696541739128, 0.6269957291187613, 0.08086821757706719, 0.18229599259127482, 0.5968955341354899, 0.47867312364745573, 0.12172313759317677, 0.8475809763318986, 0.9905970120080796, 0.9582482602521519, 0.777090411238719, 0.40762890505815386, 0.08519490507091987, 0.8694704869091149, 0.09131899492694528, 0.939270794002261, 0.6834004914310883, 0.6745076928269694, 0.7271922679871783, 0.2518346574681938, 0.34161124613185434, 0.5827327825149043, 0.5041230959063391, 0.3938840360442173, 0.4997492018707923, 0.3462394753153504, 0.7756428982415099, 0.670522182850147, 0.8517723625285116, 0.7979962066971444, 0.38179158805866853, 0.8797012125136657, 0.3118095752804685, 0.15726641156877308, 0.45507937381615693, 0.9907054567766206, 0.46696381433201595, 0.02491939416215605, 0.42663452973296256, 0.2656724827621181, 0.6481486621478556, 0.14934930260842216, 0.4916782801944869, 0.9958063639853523, 0.4008547648213161, 0.3624763986208185, 0.10203996044306429, 0.17066480213451074, 0.967309447197565, 0.8663216104886438, 0.1988549145806452, 0.5559979232749849, 0.008282175613916642, 0.7503211452694112, 0.222016892842818, 0.883854720750384, 0.8594690933003086, 0.07817769248666584, 0.40439833152656957, 0.6182014604209056, 0.540984258221134, 0.9641437258322888, 0.9182423513417655, 0.8870483723166156, 0.2726322263308768, 0.26934257688309193, 0.13285689777927467, 0.7897624660761421, 0.5990970402667127, 0.8220526287712195, 0.2535473486759505, 0.4212478152291371, 0.39286212621775884, 0.227714230984002, 0.7879159536599176, 0.04127062125311298, 0.9821945227009999, 0.714866550480822, 0.08596163788177857, 0.48425799239470413, 0.9543671211997807, 0.436179817975189, 0.023261910344376968, 0.19229755020686867, 0.14527283475380504, 0.7404382927099391, 0.2587191677342541, 0.4960533149798736, 0.5123363028621093, 0.9276820877799545, 0.8189430148789588, 0.22405508219119652, 0.3839507359969234, 0.4877003438866848, 0.14939093130417824, 0.6015088364756451, 0.2832703782346391, 0.9560148675060886, 0.35981705672321074, 0.23184457749469345, 0.48962206559707433, 0.6638307512387094, 0.5669882406933221, 0.2973501121747686, 0.41334695887505535, 0.7647351398913057, 0.8000317043341358, 0.6246940578257788, 0.35591518413378176, 0.652504972391782, 0.43440569501794657, 0.6155115380891009, 0.5548035709217882, 0.9202728969511118, 0.3299462773332228, 0.11158917741515695, 0.16911296979595802, 0.44764703163235386, 0.3781288203101235, 0.23989293632119824, 0.23992988076203348, 0.9011194257006615, 0.5467048460611232, 0.3928315318515829, 0.09397323699865123, 0.16932331843321358, 0.14663099227094079, 0.9056239139325746, 0.25860735209485364, 0.6392012927707831, 0.26876021553146534, 0.8726240462135711, 0.43660761036056583, 0.9324409558077006, 0.9423206783641448, 0.9558334081960309, 0.9168861295036829, 0.4252205825253107, 0.19107304041435014, 0.3622909408901349, 0.0627799907718537, 0.07941208985781145, 0.4828748848649992, 0.5382571071531446, 0.605235872001492, 0.6729437002663536, 0.450869469273959, 0.06976424569891937, 0.9021804341285355, 0.9305827497839845, 0.9708084215325645, 0.7280508324996897, 0.5866714392432478, 0.8406958729599845, 0.8129453559792003, 0.9667782350117717, 0.23235248008213794, 0.13584377679494752, 0.9868954096658711, 0.6742223460407185, 0.7962800469443131, 0.6558462692316729, 0.03752939034478475, 0.4273306283754156, 0.4077175019504665, 0.40819756507944027, 0.8751865147930573, 0.6330860488652975, 0.40404857664316984, 0.36801149905270225, 0.6569335124476922, 0.3586500982183598, 0.23766718150100052, 0.3805326322633886, 0.36793960537847914, 0.8133623325614764, 0.8020440538292943, 0.7352844695275992, 0.18274792597435296, 0.46869445530249376, 0.37485274423221815, 0.9806855306372836, 0.21639254300572774, 0.8346622980328114, 0.7502511004225771, 0.8310188598715534, 0.6709805770313886, 0.9318392273498419, 0.4809423061951893, 0.3826288108918302, 0.38798199332344985, 0.6585209162939407, 0.4884999963853932, 0.23376698843825083, 0.8305094389760834, 0.9447681617660724, 0.20600775436407515, 0.053370457426014095, 0.1578287426805538, 0.6060074692648495, 0.19279917288322768, 0.8943331515007142, 0.19115962779258278, 0.2869461835622211, 0.4404939333913752, 0.2381973931712249, 0.9776936639552779, 0.3131196454331705, 0.7624428871346685, 0.392442681751193, 0.8450175691785148, 0.31154467882284087, 0.49839005475263, 0.3308337341591151, 0.35683912640921644, 0.3728027526723452, 0.7377153328914179, 0.9265366715106017, 0.5966650233922293, 0.9105931903034632, 0.737830185846818, 0.4416438474211414, 0.7226539063588099, 0.4323985842423623, 0.4776199279521962, 0.6467416819098535, 0.6465298760292687, 0.3768892482086893, 0.2780679860381178, 0.5420839264231079, 0.32732053413777873, 0.5615601360153878, 0.6265838886047564, 0.6817384253806743, 0.236037200433735, 0.8549021184530856, 0.32491067451182487, 0.1729724367213551, 0.5588699642159003, 0.060942787338737925, 0.227684909135918, 0.9631935202086255, 0.4124203468712162, 0.3089840744016117, 0.6888996613826175, 0.2767360400521024, 0.9655524913426613, 0.5062087877354687, 0.138098556481681, 0.8892717837142634, 0.13061165623222215, 0.5647510265860574, 0.7097343032189467, 0.9917210958209349, 0.8566156918923058, 0.7506481918297923], [0.7283303872888203, 0.5052051329967595, 0.8303948889935595, 0.5847140623998692, 0.7703445001480166, 0.693126320887568, 0.5332948223071715, 0.10437103356193489, 0.38872234397683303, 0.9931326562412894, 0.5897698176153142, 0.07327619038529753, 0.04649764550666413, 0.10240638015470571, 0.8928566055304153, 0.7317582948819877, 0.10594178528618836, 0.7182452884973625, 0.8221746068904284, 0.26221711960137206, 0.3490818289389547, 0.9550590644856165, 0.8013821213930646, 0.21172767525787317, 0.6885071850369172, 0.9167808511481483, 0.23827721336209995, 0.5199422335126429, 0.7788899942993782, 0.39459754350371, 0.032047353714767524, 0.057701970155459636, 0.07229258527566373, 0.035385163673859577, 0.436932764035766, 0.7822704708219606, 0.30030396149472227, 0.7629962643461748, 0.21430023626736971, 0.8132796391939129, 0.7658393619382444, 0.6766177884561025, 0.35818454260549293, 0.0413137402104663, 0.6389613972073602, 0.9225952188584456, 0.28165913331475856, 0.6000157568283581, 0.22991584285486077, 0.06690520582971748, 0.6685349274474939, 0.41726531543567846, 0.28198416247003466, 0.8894517115959427, 0.5356133493627673, 0.8274342711160441, 0.7528399475556952, 0.008849440079133575, 0.713546449454443, 0.8604256046051652, 0.49682442289005013, 0.5947671765062965, 0.11770711958791913, 0.35357211948352163, 0.3801466584109322, 0.8389384138957932, 0.21097800754378337, 0.5971267173432231, 0.9037469113132779, 0.17896687412708268, 0.04206352613829789, 0.6968438401077806, 0.818684700484563, 0.9855346258205017, 0.3887450833661328, 0.33697300572202626, 0.8138050742639538, 0.6570498680121499, 0.8552662171477298, 0.584506070940475, 0.33650863553112975, 0.9181393081193227, 0.3625627615807794, 0.0014194257365940377, 0.5440834011287863, 0.7968428005349986, 0.0407955083018815, 0.3307510810934242, 0.1845692441410226, 0.4736609168647191, 0.6664868124488428, 0.11301621613679647, 0.4053846652323091, 0.32897663027490354, 0.5328459105130695, 0.7738217928248058, 0.660012274738389, 0.2628495236175794, 0.5550572677329927, 0.4215845211730056, 0.18316866379104735, 0.31652655966799403, 0.6221983226889372, 0.5191159697861443, 0.9537570303177507, 0.32518717796936414, 0.7111771402565551, 0.513374555101457, 0.8872002959736017, 0.7920503945144405, 0.17043450920912695, 0.10615975785075726, 0.38021178507807973, 0.6212056818229527, 0.8834334865708526, 0.8066421820771339, 0.06942677276934872, 0.7162797937748174, 0.30119136226020427, 0.07746626758372843, 0.645989249150338, 0.641833345528331, 0.8610718621468427, 0.06832549617719397, 0.25514258889552, 0.7212183105993425, 0.2543347352020069, 0.14218669123094085, 0.13972039621707844, 0.46558271041130617, 0.8633851618601933, 0.3661916133387155, 0.4488549020308348, 0.05663526408726971, 0.44703015346226305, 0.04662980150466278, 0.9517910389076132, 0.6951004745547658, 0.8895165876702512, 0.16267381196394115, 0.32653281682773183, 0.9283526669346936, 0.0035340532258387736, 0.05191434274976192, 0.15986339615309075, 0.1315640933210539, 0.5773472853975566, 0.5465897829392937, 0.311739568650933, 0.8556716735670625, 0.9336570684640642, 0.8428759982437568, 0.5716420419195466, 0.8628601457574092, 0.7704472084447048, 0.04397774064855009, 0.747050724004981, 0.29500982424396927, 0.7790738492962384, 0.46388202144293855, 0.41341177487986014, 0.27934104516155644, 0.2082162462276398, 0.8558621533084056, 0.6742948354712962, 0.18239169903586538, 0.10324847141388138, 0.3642034427252968, 0.39352126844224533, 0.04969679787523662, 