{"class_name": "Model", "config": {"name": "model_12", "layers": [{"name": "negative_samples", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 4, 1], "dtype": "float32", "sparse": false, "name": "negative_samples"}, "inbound_nodes": []}, {"name": "lambda_2869", "class_name": "Lambda", "config": {"name": "lambda_2869", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTEyNy02ZWNlOTYzM2MwMGE++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["negative_samples", 0, 0, {}]]]}, {"name": "lambda_2870", "class_name": "Lambda", "config": {"name": "lambda_2870", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTEyNy02ZWNlOTYzM2MwMGE++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2869", 0, 0, {}]]]}, {"name": "lambda_2895", "class_name": "Lambda", "config": {"name": "lambda_2895", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTEyNy02ZWNlOTYzM2MwMGE++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2869", 0, 1, {}]]]}, {"name": "lambda_2920", "class_name": "Lambda", "config": {"name": "lambda_2920", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTEyNy02ZWNlOTYzM2MwMGE++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2869", 0, 2, {}]]]}, {"name": "lambda_2945", "class_name": "Lambda", "config": {"name": "lambda_2945", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTEyNy02ZWNlOTYzM2MwMGE++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2869", 0, 3, {}]]]}, {"name": "lambda_2970", "class_name": "Lambda", "config": {"name": "lambda_2970", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTEyNy02ZWNlOTYzM2MwMGE++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2869", 0, 4, {}]]]}, {"name": "lambda_2995", "class_name": "Lambda", "config": {"name": "lambda_2995", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTEyNy02ZWNlOTYzM2MwMGE++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2869", 0, 5, {}]]]}, {"name": "lambda_3020", "class_name": "Lambda", "config": {"name": "lambda_3020", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTEyNy02ZWNlOTYzM2MwMGE++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2869", 0, 6, {}]]]}, {"name": "lambda_3045", "class_name": "Lambda", "config": {"name": "lambda_3045", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTEyNy02ZWNlOTYzM2MwMGE++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2869", 0, 7, {}]]]}, {"name": "lambda_3070", "class_name": "Lambda", "config": {"name": "lambda_3070", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTEyNy02ZWNlOTYzM2MwMGE++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2869", 0, 8, {}]]]}, {"name": "lambda_3095", "class_name": "Lambda", "config": {"name": "lambda_3095", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAAATAAAAczQAAABkAWQAbACJAIgAagF8AHwAagJkAhkAZAJkA40DfQGH\nAGYBZARkBYQIfAFEAIMBfQJ8AlMAKQZO6QAAAADpAQAAACkC2hJudW1fb3Jfc2l6ZV9zcGxpdHPa\nBGF4aXNjAQAAAAAAAAACAAAABgAAABMAAABzGgAAAGcAfABdEn0BiABqAHwBZABkAY0CkQJxBFMA\nKQJyAgAAACkBcgQAAAApAdoHc3F1ZWV6ZSkC2gIuMNoDX3gyKQHaAnRmqQD6IDxpcHl0aG9uLWlu\ncHV0LTEyNy02ZWNlOTYzM2MwMGE++go8bGlzdGNvbXA+UAAAAHMCAAAABgB6PWdldF9tb2RlbC48\nbG9jYWxzPi50Zl9zcGxpdF9zcXVlZXplX2F4aXMxLjxsb2NhbHM+LjxsaXN0Y29tcD4pA9oKdGVu\nc29yZmxvd9oFc3BsaXTaBXNoYXBlKQPaAXjaAngx2gJ4MnIJAAAAKQFyCAAAAHIKAAAA2hZ0Zl9z\ncGxpdF9zcXVlZXplX2F4aXMxSQAAAHMOAAAAAAEIAQQBAgEIAQgCEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_2869", 0, 9, {}]]]}, {"name": "entity_embedding_0", "class_name": "Embedding", "config": {"name": "entity_embedding_0", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 10, "output_dim": 256, "embeddings_initializer": {"class_name": "Constant", "config": {"value": [[0.24393981933982922, 0.02970606715494828, 0.961018323206339, 0.9126666739559584, 0.9539392245827347, 0.17374949212158086, 0.8062568193079922, 0.10361684753082367, 0.5926583107280652, 0.086134884267979, 0.934190242524651, 0.5335991221627949, 0.6128298940951127, 0.28546551949290877, 0.982409918682616, 0.4289603189025011, 0.9996156554793606, 0.38106263454770106, 0.8259084028981231, 0.6596370404345652, 0.8470499425428418, 0.9929178348516233, 0.7549744775601641, 0.38333725139934116, 0.15537337610442326, 0.1845267554819141, 0.17265466978140742, 0.09908681045917622, 0.17724333935375047, 0.8485102617562778, 0.9537107176808285, 0.026682403004818722, 0.1526026991518692, 0.9690966478136144, 0.32062154837950874, 0.6868637784890386, 0.23785689564778312, 0.4282279832532979, 0.949948859792831, 0.9468814156318174, 0.7175413612726906, 0.9746092350870815, 0.3721216370127012, 0.8875383513072115, 0.8548276140367851, 0.8182125385535357, 0.3010295094436706, 0.5538459809841915, 0.3093460089848018, 0.16710574846745474, 0.6484432258627958, 0.3812933179971377, 0.7890046874854163, 0.8067933266739292, 0.9189152588757007, 0.03000860980594633, 0.552288380348401, 0.6516488537859242, 0.9856169975900598, 0.7001609723815202, 0.3663103663999657, 0.8376557493073845, 0.5147612265105759, 0.9142702606964128, 0.6936860236177079, 0.2720369130988215, 0.21746381215136212, 0.9643383046727161, 0.37252552131172656, 0.4432825794835229, 0.7340500007378251, 0.1529045011285235, 0.29791894608336145, 0.1742375828008711, 0.6045335240830816, 0.10500171610660436, 0.09851489889415521, 0.7626681458702637, 0.4880178967090433, 0.6190112978728641, 0.3154901189083271, 0.7673429807272429, 0.9496861348391671, 0.8678620800240939, 0.9723976777527138, 0.6403299498180569, 0.139706153961222, 0.9650842407037513, 0.9940731438876862, 0.034867470865812655, 0.7678294612939115, 0.20551713109712888, 0.6471333662096402, 0.11413783218465667, 0.9136372436228772, 0.9381903568462561, 0.8666849612737375, 0.7534364371963918, 0.3187963278882072, 0.4477111217909253, 0.709882557102021, 0.49492956642735597, 0.6557576765008796, 0.1167580033209904, 0.5143190162067823, 0.48275237317220643, 0.13656838136824945, 0.1076380978530661, 0.7169172427382565, 0.30833123214608327, 0.39521080683894527, 0.5103484157506755, 0.5001363419505139, 0.03907379432862623, 0.06861899351745038, 0.3909616414711026, 0.823076614475352, 0.07247957761218449, 0.528955405496827, 0.2658728678226936, 0.47336741568457374, 0.5714657004173813, 0.27654155896835775, 0.47051597626870745, 0.765521341672117, 0.4582540330893362, 0.9109190178167375, 0.3406050757188658, 0.11785115410175084, 0.9679022403582525, 0.07832590112363214, 0.592478781001069, 0.35970330469323875, 0.9665521629994974, 0.8916241232771419, 0.13078061731924417, 0.5241210918821358, 0.6166040855369999, 0.14933278665533534, 0.912673725205789, 0.4064322507734792, 0.5537300043260308, 0.282189563269704, 0.038446098134158, 0.9333990455945999, 0.5406364651710989, 0.1975167963669754, 0.913037534125172, 0.9723110122175022, 0.44115030255401044, 0.2582511712819685, 0.5801341642206508, 0.1259252379598067, 0.5319559527064324, 0.642441097822996, 0.8191087444005275, 0.7584024702377495, 0.13381533121942002, 0.15206591985638584, 0.7667709146122822, 0.006258233259957113, 0.5520542674070964, 0.22033836049004363, 0.489811923672975, 0.19862399679006348, 0.41898509466633016, 0.2948883065317933, 0.9445690400847607, 0.3597475439316682, 0.9177081825770792, 0.4182256589781662, 0.833458174898215, 0.21954362870233857, 0.0794580758710749, 0.9116211560192883, 0.4979247663273887, 0.17940483618409775, 0.5604429043478201, 0.2124456773161031, 0.22143589319370294, 0.5600924671007481, 0.4611809211724569, 0.8516727481979293, 0.5891631016574297, 0.017669329270297296, 0.9654161138493438, 0.8673565430669868, 0.11418315573741178, 0.1783902507217855, 0.9435376571998355, 0.5642425480482834, 0.649892419854614, 0.050167655620661944, 0.1284066806162919, 0.3686797296653588, 0.7949568154505, 0.9324185269020135, 0.34752077372067136, 0.942079315793881, 0.45696748574490154, 0.03261464896496569, 0.19929346424989036, 0.008715105308517379, 0.10849446719335265, 0.7760511149770748, 0.6016918874670278, 0.6442178839881746, 0.35053730089138235, 0.48393424822579056, 0.7877622802124565, 0.675901267774493, 0.6539821379286148, 0.617651213327244, 0.6449753818422573, 0.8453393454735801, 0.009146299197796859, 0.8367608397729072, 0.24447551282327273, 0.8543997112234355, 0.06044509604788384, 0.9408790991123828, 0.08901146722288289, 0.5620560179816103, 0.029135229362725057, 0.6631764456992638, 0.4707183798578044, 0.864375770208276, 0.2990369173170281, 0.004730547000130536, 0.9318172779413798, 0.940683996176466, 0.16772569140389382, 0.4429564138822957, 0.6338658646741205, 0.21756460732003846, 0.05494075607341742, 0.05744458338357028, 0.012529139976074521, 0.3305267162155604, 0.583650183712383, 0.17012940251244668, 0.6760321866832154, 0.19789071288302573, 0.3701867495683302, 0.5422160311906766, 0.45492143430593435, 0.7258686631064148, 0.5626218039960348, 0.08043422383588827, 0.8821224069271816, 0.8250150500813952, 0.18102829569426226, 0.2822950859303699, 0.3597255048672491, 0.23912776805064828, 0.8719646421738291], [0.1880535443813418, 0.6751969438696218, 0.30875515471074155, 0.7142229261085201, 0.09812071361299868, 0.886065467166434, 0.5417436082046484, 0.14646351334906405, 0.1973011274400156, 0.21586116894508256, 0.35927820328902826, 0.5379293925935297, 0.30156870004614067, 0.9934024161628667, 0.6236988542668795, 0.09627950145963493, 0.9872394086392482, 0.11151786380087458, 0.8689720139003366, 0.365601364246012, 0.7411631807155263, 0.3830171041179339, 0.7390774522837665, 0.4635941022733904, 0.3909023211865946, 0.2980693480942329, 0.8260586851617595, 0.9788466716217511, 0.5464521882077324, 0.8134704573697098, 0.055613069376250324, 0.33254472355307774, 0.4926933705442842, 0.6485202216091016, 0.6895640830399699, 0.8878859690586676, 0.6255297916221538, 0.24616655358797923, 0.3698124896797138, 0.7413488610684622, 0.31021473992587756, 0.9667325499965023, 0.9931758961841137, 0.029400611367973895, 0.7739799747947109, 0.10745116576120761, 0.9195592236519836, 0.09604306715985056, 0.4942173206716616, 0.1839140477453236, 0.017249294020398764, 0.15226433254270988, 0.8378191398028861, 0.6582861721607792, 0.9008293336925193, 0.5861267168730434, 0.11097728820853348, 0.6322130102639737, 0.9521525314705517, 0.7538967229627186, 0.7767934076178676, 0.5519281683717064, 0.35791718182881316, 0.6176153890281907, 0.19869967016910572, 0.8219855508295656, 0.5397867462218624, 0.15581855774668218, 0.04492725214715998, 0.8799294380807255, 0.6018972490718415, 0.596203693574154, 0.09109455770068975, 0.7775756807730142, 0.6269734983604377, 0.5684076214657381, 0.12071200849730623, 0.3138728326532767, 0.1109964879534393, 0.7521672370486242, 0.8242082259488555, 0.11124037238869622, 0.5380020655918664, 0.6446868973132195, 0.39224388093887086, 0.21385080646742638, 0.28102191572266577, 0.6637501061052663, 0.7762469344999191, 0.3374848905065475, 0.8898450696990384, 0.08408687811980053, 0.11295809457345196, 0.018172703137433577, 0.5575652709990578, 0.4106855494855669, 0.6476440080548052, 0.3202146749559769, 0.9177386225706626, 0.5451088303799995, 0.19167200694817788, 0.20314759609271293, 0.20588806717615815, 0.1708120959316909, 0.30599565635439907, 0.8751482415169957, 0.14312045051522393, 0.11900822206623396, 0.5184770612995778, 0.1598958386397178, 0.6204297584453302, 0.45251156977405216, 0.6415938366492362, 0.1244221685155682, 0.2622392164532985, 0.6721577952432941, 0.7462852716750014, 0.6728774537074278, 0.7269303856730064, 0.3829115946206433, 0.2395887959626345, 0.7238006589046325, 0.7212966626239433, 0.922823909091504, 0.7696201856689858, 0.5314321196716113, 0.25295306464907286, 0.8454379998932786, 0.09564721066710447, 0.08370097727716397, 0.7351374215026011, 0.353884393315832, 0.4308176273247949, 0.6986468531280905, 0.7140051913352137, 0.5611562161609034, 0.42301584567098915, 0.9326688418299425, 0.4080743614268265, 0.26021258745406295, 0.4934221978860168, 0.49029200850126287, 0.3472647586270311, 0.20150538070975454, 0.7662672558378336, 0.8749270999251934, 0.9545919589328554, 0.20273724611608268, 0.7103595405082572, 0.11102321288805883, 0.7086820822320955, 0.5628897202182034, 0.46351893222173146, 0.24090689049338276, 0.4039659978162352, 0.12549181986174152, 0.5913879349685311, 0.4611940515346489, 0.9422114694261232, 0.5233890877739971, 0.5550426834726836, 0.26640572603598356, 0.8693111503177694, 0.21601801286732003, 0.9697432426967912, 0.8247229042326737, 0.5452683992790257, 0.7531550591871983, 0.6510892593020772, 0.2147461169163235, 0.28467373573932286, 0.4829983726217546, 0.771355990807342, 0.463083170294325, 0.6433056568124182, 0.9045203011288229, 0.3167098371825776, 0.655058911070502, 0.5800488681962155, 0.06456064630766467, 0.48598470699436525, 0.20682108231777296, 0.7012620609939779, 0.14617433991007367, 0.07344777122037449, 0.8613945775413171, 0.661487981775166, 0.39486092768915415, 0.7043441058675088, 0.7374341628567368, 0.12472981300227204, 0.5644453415462348, 0.629752555385958, 0.5905088823603406, 0.15240595448545546, 0.6994581787794373, 0.8714184529032607, 0.6737167747595924, 0.2773330463303645, 0.5235332826042061, 0.19355583602780335, 0.38481351224533344, 0.9765280450792818, 0.23462725383707972, 0.1649613960476478, 0.03832056490001179, 0.09816937392573843, 0.9731356634580239, 0.40502244649563834, 0.19262987060853687, 0.49784301433076583, 0.6682709187651101, 0.638273158899031, 0.3260460772009026, 0.792507082250262, 0.16703317862612854, 0.5213842750056445, 0.868314735947545, 0.8048396983914254, 0.8924257143154866, 0.02555513237203899, 0.975708282770268, 0.46286354806891106, 0.5779483336397028, 0.8950066688019367, 0.987071855960013, 0.3047126808784184, 0.6311349684626819, 0.009459773614935107, 0.41792738817369257, 0.4627176080315727, 0.7300347798155186, 0.6621780806812191, 0.013948243467552857, 0.10789076314923374, 0.5959973920250479, 0.6066538876717898, 0.21914366678766306, 0.4492321376866085, 0.3281877042954804, 0.13920658623155902, 0.7738142476627536, 0.04414272790485119, 0.04392137307076838, 0.12132598061569655, 0.578628771695478, 0.34986237490952055, 0.13058212130202773, 0.5260875798109875, 0.8432512833872755, 0.5642551726461166, 0.6013888892479072, 0.5099642768728591, 0.13706763252412524, 0.021681695245806543, 0.0817537156272623], [0.18977202643488966, 0.899942750260051, 0.39153181636739987, 0.8505271160573236, 0.49433976858282913, 0.7012323408005091, 0.7160898006783931, 0.5927125376812171, 0.9590656616499817, 0.6880401882878113, 0.8423655530952759, 0.819563333272488, 0.6890489643231706, 0.48027268941120904, 0.21736543269162267, 0.08736821314892473, 0.6764865403817327, 0.5215450410467595, 0.27991775382256157, 0.3568755713881725, 0.7694515206584248, 0.2815247877002097, 0.7029399732311754, 0.32529374663470734, 0.8450626481021627, 0.6529908577764597, 0.25607103569608514, 0.9294208096324786, 0.47275155600335583, 0.5424356145013013, 0.026621886611281842, 0.586103729415208, 0.9691587531907632, 0.6593823259500572, 0.21125636582439922, 0.7700974538070082, 0.8256836071780672, 0.016700291351253505, 0.26630322684738683, 0.7234537343732085, 0.11633516813551703, 0.6316844124120622, 0.5127776399144678, 0.5966786688281227, 0.746216749950156, 0.656586176309006, 0.8611174919939004, 0.5388729559194291, 0.7819218962519225, 0.7531738754835019, 0.8968182573636423, 0.25221118866696723, 0.7571846203335934, 0.2981307771365498, 0.8532073801476476, 0.9947530956416907, 0.8364742882300662, 0.1395738715776168, 0.007353247720532474, 0.9419423727640316, 0.4792319163147253, 0.47414382512393705, 0.11623374863084734, 0.8751840222222544, 0.9245251460721385, 0.8645954892803822, 0.4402473974136457, 0.5521339780275698, 0.8923482791304418, 0.6406822216136044, 0.4923702630243919, 0.822239430926061, 0.32834664022952376, 0.9423182327016172, 0.742400888226116, 0.14911254883204306, 0.8273404702379671, 0.2733774430487802, 0.3185262307731135, 0.7056629805258923, 0.5131016647855502, 0.6405892608187961, 0.19373893686527632, 0.8011170818501391, 0.36425788932916137, 0.02990037248402877, 0.9312969853092206, 0.7731057623633181, 0.2057226563696034, 0.007607991978557771, 0.42930289549836853, 0.06433698733360071, 0.32939970307257593, 0.7935196888117695, 0.039007139727956774, 0.8448307328938918, 0.7411602736202182, 0.6391926261779646, 0.8589752141375206, 0.3040672575155112, 0.32900910886315216, 0.23901270825918042, 0.024497070435511303, 0.2893849127440612, 0.8818961873276319, 0.08797880235434974, 0.4418395367472492, 0.12373787289880156, 0.66994997267436, 0.22038959404835823, 0.7126113836798743, 0.7359945086873717, 0.5534149214482215, 0.12557695463861973, 0.9299710115184331, 0.8309419428588769, 0.7011154822859218, 0.1875801080611057, 0.011390526658897393, 0.892910609930605, 0.2001552756585815, 0.5978989110156826, 0.4283257942050308, 0.27311582230340303, 0.36724955366609546, 0.81168945890212, 0.8019573161882748, 0.9826127472142306, 0.7524664185180746, 0.8211918368476686, 0.6834622858388233, 0.6088656122895157, 0.37393690786254974, 0.13162667172587872, 0.25428362089018264, 0.44939429941460485, 0.07202776980753922, 0.4797065945910589, 0.6899705339002882, 0.620848321898765, 0.06213986490647738, 0.04978930676809923, 0.035827451717184156, 0.34663395464211677, 0.48602174674010934, 0.6585268617864571, 0.7862430752368457, 0.5181896327716238, 0.301696787879977, 0.8724737282250095, 0.8449059945243308, 0.959162256313063, 0.6756543578104229, 0.2269108584064342, 0.08052587348763907, 0.7680689423649515, 0.774178604752433, 0.8454832335885523, 0.27977704907020406, 0.32914792606210586, 0.2835285354376704, 0.7041878600349014, 0.48121680439908066, 0.534324579799479, 0.7908439858305023, 0.83543287962035, 0.7234128518029462, 0.8533012267339711, 0.8948194860660317, 0.20130203043476502, 0.32646566780726827, 0.6441257097293075, 0.019597115791909037, 0.2174879312821092, 0.48495848528493013, 0.9176385751672762, 0.6118214859284308, 0.36307713866555824, 0.20201808439962576, 0.6349381198756934, 0.5664930141712137, 0.23397457541259592, 0.21817810579430064, 0.6435966551385405, 0.8419659684832158, 0.4567978952763475, 0.615737919860187, 0.7394093434131166, 0.38273870260435905, 0.5854953654960385, 0.8706656959814119, 0.5976379103844028, 0.3300411318736417, 0.1319967036392854, 0.7536960457214434, 0.35346276262474763, 0.6577687846761974, 0.9881777462248382, 0.9862403235880709, 0.9854311611543829, 0.7515790507550937, 0.6758587447206833, 0.9211652893042368, 0.18676944021261066, 0.7587545521547467, 0.6759195828831219, 0.3721498885743001, 0.1831216116485075, 0.9080120209235447, 0.09089812876072967, 0.5916403377551139, 0.1651149010842291, 0.8984761771957577, 0.5432813123424116, 0.561961137495391, 0.1774889450715197, 0.6608868964931457, 0.46719106938963295, 0.8474382859951783, 0.4707745532309121, 0.5367614807914753, 0.9705960116739392, 0.3441687036516271, 0.23964061352697474, 0.5754519794906043, 0.6929182913216301, 0.9704154948232118, 0.9829794654760747, 0.7736581240662228, 0.5858483258237743, 0.17558467992999682, 0.877930764621383, 0.3405453788045024, 0.08832348430942749, 0.42520537667506975, 0.5220376536114874, 0.7442918800929695, 0.5425319845185581, 0.9880655136954102, 0.29141571175182335, 0.45350228773643564, 0.43095061702376714, 0.5563866428370496, 0.4027348231220017, 0.7344859532230208, 0.6866761244221398, 0.767057468928378, 0.855124720544583, 0.8238803832312395, 0.29097017241744194, 0.5513795250794862, 0.8095929470060407, 0.9577022304395649, 0.4606654357892679, 0.10619039996943258, 0.5423026012361679], [0.6279504347991336, 0.4487952451096775, 0.9064763436609905, 0.6493915527796991, 0.8122940812258594, 0.768019388427299, 0.4149570155729536, 0.2675522172095335, 0.25644147489328395, 0.4897800735324185, 0.2668414982219526, 0.18137370968286393, 0.06142967283353806, 0.3019090150170991, 0.6233244784642076, 0.18033484355129525, 0.7003756071896842, 0.7311504101916885, 0.8293877887065133, 0.43599517193905124, 0.6239845997930306, 0.1578354523535439, 0.19739912643387414, 0.25716765878215975, 0.6778420306766754, 0.24833089829489796, 0.4036100519714657, 0.7156861264164368, 0.9685278179596517, 0.3835742434723812, 0.384062472521022, 0.2685810161125948, 0.6912931175673453, 0.730254021170847, 0.6202435190155904, 0.754222392179622, 0.058763559816110145, 0.0485270711340936, 0.14854463790680106, 0.43928050353167736, 0.26361624275557083, 0.18319565821518735, 0.7000893465529597, 0.17334286956818246, 0.22051678688054888, 0.122677325670414, 0.4948382900670085, 0.40948663799809903, 0.39168954193517425, 0.836057678766015, 0.8936583591880315, 0.4111020994515362, 0.12528405095322537, 0.8007766897217701, 0.44022439157899584, 0.5209262412927983, 0.40315571928130145, 0.6661901383499899, 0.65234854131547, 0.7234954947119702, 0.9006374352353809, 0.5158142961162924, 0.007790367030161782, 0.06130778180212326, 0.38160410170806425, 0.6237390620574902, 0.5288932683850176, 0.8471449966059696, 0.17675858214255313, 0.574101397420864, 0.12251788296229105, 0.5158903407473021, 0.6595071447926492, 0.21691222908931074, 0.10784725688186703, 0.6052244763972675, 0.01585484030686224, 0.9676966575996483, 0.8396446897741376, 0.5512303653969539, 0.10295264662596049, 0.7775778840941305, 0.19917612165890175, 0.6272548372668291, 0.8757783632663128, 0.5441079067952875, 0.05208480658736592, 0.15489644366323674, 0.3337963561887134, 0.8982059328120132, 0.6035345645175451, 0.43465431608948324, 0.5888577688550375, 0.26608286791129243, 0.5481576048075442, 0.7451034578787683, 0.08710251269721148, 0.7765003017514598, 0.5519734727138338, 0.5866062803367553, 0.5569959303349251, 0.01847785064172036, 0.7846093533119793, 0.8650624154385964, 0.41147911531031056, 0.7766499475815379, 0.44570475818034416, 0.7064071962847615, 0.7109194564252181, 0.44957790206173043, 0.4036768082487556, 0.5637148711869128, 0.5805357832519802, 0.9564389028256378, 0.40682388899762933, 0.6001556066220072, 0.853072056272077, 0.10562040991968213, 0.8536217950856253, 0.01981145493586045, 0.652292234846608, 0.7817640970483485, 0.2875858202955094, 0.17235839421300714, 0.5915620216843817, 0.05730705217654719, 0.879464965907353, 0.25797769061594256, 0.2966452098695169, 0.6380423254469478, 0.6718047727433026, 0.7615167034894038, 0.2980287691673289, 0.726283557992961, 0.9049248953371432, 0.8393152628616767, 0.8889956430271734, 0.8389280815702066, 0.18872307279050737, 0.8261102019506723, 0.07684572104154641, 0.8584682427758099, 0.346549868009858, 0.6758839914919939, 0.4937868826590094, 0.8514950646545262, 0.01971014374092661, 0.25450165766737043, 0.8337838077783316, 0.5906647154884773, 0.36038929129499775, 0.2962465950548515, 0.836655835693765, 0.7289250337631319, 0.23659649011460437, 0.14512355231154161, 0.6705724338145401, 0.1249461298243435, 0.5277197827026633, 0.370550232949158, 0.21812615607735275, 0.45057090448329407, 0.2504098725458669, 0.3555918456113786, 0.18413337895472282, 0.34842235578701053, 0.5422658847141008, 0.6867452682551146, 0.3530560449096284, 0.48652653749821073, 0.21525308594350545, 0.9550791208305321, 0.5712662017562241, 0.6155124525422184, 0.24595744009124987, 0.9915207090965831, 0.9045516436976287, 0.15312441172295588, 0.791013348815574, 0.0924384461330453, 0.9723582635555461, 0.9384441049464295, 0.21191127085739736, 0.5699754987662363, 0.21500484573080547, 0.31718176417241717, 0.8028535860940309, 0.16659379432390808, 0.7418573476583721, 0.009350515923101432, 0.7373090166187855, 0.8798558166300287, 0.40294691684687, 0.9202610459865134, 0.6927329260991839, 0.5753904303869367, 0.837180559647386, 0.7295671789072332, 0.16746676183389686, 0.2783515201639878, 0.15624257257817897, 0.5283173260670034, 0.1989610391507073, 0.29832560327049384, 0.16235172010956422, 0.3990231564516269, 0.7040169191372481, 0.9817588585533673, 0.1491812797675579, 0.07011131806164184, 0.2598904533416647, 0.30012720351768873, 0.8663860799295098, 0.536976129225214, 0.09692762894580875, 0.8448284076381471, 0.5703572162563568, 0.5427287185662125, 0.8443064493635716, 0.012418385584628489, 0.7243386958109926, 0.9491791733741335, 0.6659712990368195, 0.056218275214626634, 0.7864503294387747, 0.5037975827622068, 0.20643419938791907, 0.6767904575454409, 0.33289434995128186, 0.3025690570936793, 0.62555379158502, 0.9012244235062605, 0.18726584924068335, 0.4047107946694717, 0.9105933284078324, 0.9311061014890981, 0.9951850946112104, 0.09749702184033748, 0.8448919165586583, 0.8800907685413684, 0.1227674550235679, 0.7611356871325392, 0.7896424783051558, 0.22621075280634784, 0.38255600448074123, 0.46451452657378733, 0.9808255084406156, 0.9293330244154165, 0.1411703024435521, 0.4155895897103532, 0.6350145444516996, 0.7246086868897161, 0.3630020465367818, 0.5415778476854335, 0.8956769091072345, 0.6396130918906199], [0.12833302194822882, 0.9497080497655173, 0.1322343795519989, 0.2377421880668249, 0.2515226577689603, 0.8305743317725247, 0.5329222829781087, 0.9434130811599369, 0.5417995985099681, 0.61038155681294, 0.5719655884458309, 0.40307693860059424, 0.9019684051931578, 0.4256647476505786, 0.5436286021550999, 0.3015296929349107, 0.1547208827343336, 0.9623533760785229, 0.6631705234973462, 0.5605997829977877, 0.1950073412071719, 0.06238715571441833, 0.984339721773051, 0.9993251678895015, 0.6937945792398619, 0.797446528671519, 0.9468669068806439, 0.779742823051731, 0.19115299176518463, 0.9708359096353779, 0.3438534646469127, 0.29107950909032765, 0.7557195233010605, 0.5464458482797442, 0.15005580621797643, 0.7803671566452113, 0.10278546399757704, 0.34075266852152, 0.5983791237305387, 0.2848554171420491, 0.5493556121430924, 0.44871225139293724, 0.16650309083058523, 0.9723406938805228, 0.30868642078850206, 0.593479626586838, 0.26987115661055616, 0.27567766846176134, 0.18360039462938904, 0.25105052147271256, 0.06390693017368299, 0.5579066419147595, 0.11875638864283833, 0.23217275554444228, 0.44227458620020255, 0.537366899151991, 0.483727269424862, 0.23102707682305512, 0.9356857994335126, 0.07280842680549093, 0.6288994142069688, 0.4810216084406337, 0.639700303189706, 0.23627805765549525, 0.16533024581371059, 0.410675050209934, 0.5901785968650736, 0.09785326358389812, 0.8117767083432914, 0.15870903797266045, 0.7572204533928266, 0.48678421638122604, 0.08429515127079468, 0.6518861477176257, 0.0930713191357676, 0.9119207537959828, 0.1751314492403816, 0.48331378946041903, 0.0962366020170553, 0.24502514959615596, 0.8451165168412674, 0.024673301099670253, 0.3042439245467493, 0.44723409233369493, 0.9861165167065699, 0.25844913613584186, 0.8455769802121604, 0.15003907954445483, 0.4623281099938116, 0.7538648716717159, 0.15328238317627285, 0.38228368210006203, 0.9741105914984953, 0.629287508904878, 0.17317531647388362, 0.8354930694155264, 0.8457447334067862, 0.7008812730669258, 0.43686683446225616, 0.8098574647987803, 0.8096764481581248, 0.2007252947177417, 0.4104810121128606, 0.8894616260518146, 0.531085257068819, 0.996531705667067, 0.6807353543240681, 0.963187739242099, 0.9393349511214976, 0.7280607899370659, 0.5741094788790164, 0.3657547027918072, 0.8592938765406543, 0.20492871215535702, 0.9752570757234181, 0.6353753061299244, 0.14966692071600374, 0.8939426879328103, 0.06888287712575103, 0.7066208007397324, 0.054686848134937405, 0.32753627389059636, 0.7357301310720646, 0.3222633253448045, 0.11830446192327326, 0.18180558797829893, 0.03801561391469954, 0.027383460669493376, 0.9250983765376488, 0.8874978589568807, 0.8897173484020048, 0.5993395582276385, 0.5145491071007121, 0.42808368909994843, 0.7471681243223017, 0.5224599087404364, 0.6274201386400964, 0.18306617442236162, 0.41991426411321453, 0.8388942584948206, 0.7257213650755031, 0.06931996969430188, 0.7900195726657301, 0.9868080221709976, 0.4118544160994314, 0.47999462018594297, 0.047197526365015285, 0.5902769139905016, 0.004820889317993848, 0.7220045921076557, 0.3452690763268511, 0.5775558619679364, 0.92526404080239, 0.6109542619266184, 0.26324807750942214, 0.03100615821183228, 0.36551675833225805, 0.14136755589493544, 0.477582772396282, 0.9858983429714485, 0.5225814248989767, 0.5424643171458994, 0.6884121551119207, 0.14762433224264637, 0.26375367225984947, 0.4771804043022515, 0.5272998561170384, 0.6352076415735797, 0.3734894490309236, 0.2988004124241207, 0.07610471453035716, 0.6421143091248062, 0.23316856727472624, 0.18698603044112538, 0.9982489767551297, 0.263234915852403, 0.9817673338994898, 0.7395817292141427, 0.49151013366774843, 0.4619532022855559, 0.8621688803364853, 0.5842764288249296, 0.44776789563863706, 0.4819889267392278, 0.06862698592307825, 0.3762476080869729, 0.84457752017826, 0.24849218964921993, 0.5665604253362729, 0.49094600735105864, 0.957385392974157, 0.3915345356280262, 0.5989461592004953, 0.5096961734411848, 0.3308490730313116, 0.4100026057947789, 0.2822939212422826, 0.5875089259225005, 0.5832969716407116, 0.09292385016602422, 0.9153542367139216, 0.032769839990335226, 0.2965179661519447, 0.16196989673196538, 0.41163883911640864, 0.5063658514486546, 0.011359166411818888, 0.6364726929694562, 0.24526681878458978, 0.8459203739457853, 0.4692352527297725, 0.6188238464229465, 0.0654963605591804, 0.07467940757213132, 0.1667011936267897, 0.26202047360672553, 0.6250785720049044, 0.1807216303771476, 0.9228912969191642, 0.9287743549034578, 0.8160422258745068, 0.10915523099354052, 0.3472139705475692, 0.9667424665944411, 0.6708661921616086, 0.759611341159351, 0.5195053391439225, 0.8252230594067732, 0.4688978553884051, 0.5173826979516973, 0.9646244225798752, 0.2217345661400394, 0.41402135410518714, 0.8456104084679504, 0.41290852889079, 0.07000390508016097, 0.17152681866976527, 0.1575614546994869, 0.057593706471962935, 0.3316633122620307, 0.9444852159504319, 0.15345407464818683, 0.561025567378249, 0.9972217828565019, 0.8655025847521712, 0.3561074911186878, 0.25067404887548705, 0.5128054421229212, 0.5549002748400436, 0.6090980306589301, 0.33666678347076906, 0.4172316925600137, 0.6264582882622882, 0.035409801910916694, 0.29153852303919425, 0.6327812606701515], [0.8355139445957839, 0.7538938317057883, 0.10604037128559252, 0.62365771970846, 0.6860448213051727, 0.4075641657328748, 0.45488314111989747, 0.607108912469212, 0.3873698507348816, 0.6346210008169003, 0.8106595527625174, 0.9336696214190696, 0.3427189092594257, 0.9654360522641577, 0.3207003589156727, 0.747190909132941, 0.45504480763553357, 0.20849785609352012, 0.562968041723968, 0.18318989161948385, 0.0933147796044862, 0.18101510336477633, 0.2619343824245546, 0.2385515088135668, 0.34861774922018796, 0.43326766772481484, 0.5764957027271079, 0.4979402432587028, 0.6295918801512587, 0.5850648148398727, 0.6946468871969198, 0.30179214115533126, 0.29064636715664804, 0.3953748894497624, 0.040122603835948234, 0.5293292839927005, 0.5030956266673813, 0.7603847312262262, 0.5492968234020641, 0.7701762644076448, 0.7609661108640484, 0.26245268884365114, 0.2718740416151749, 0.5822637813362574, 0.58260787719742, 0.5439927798838871, 0.870038658716503, 0.1383558187822318, 0.6700552972506895, 0.27763325734062083, 0.183533477494919, 0.15315408602572111, 0.7258952821511516, 0.7455486631516222, 0.8728185986352698, 0.004944773938723057, 0.3476738955705133, 0.132130989369748, 0.25678106093874464, 0.20241587297813546, 0.4527080007151457, 0.9535712191129924, 0.7250126627289587, 0.44461417308584006, 0.4526062211629205, 0.82581611861984, 0.5629576391392361, 0.7680942013822646, 0.7358087588760108, 0.6848455557392126, 0.42336040382235485, 0.4429040561536932, 0.4952940571012988, 0.021147960850919523, 0.8612895568179972, 0.028175654689255647, 0.07795914708040608, 0.6962310403493883, 0.027043887801119326, 0.4732328639285014, 0.7653600289507602, 0.9783176212051733, 0.3504710878157141, 0.3509265149942007, 0.029062328244890745, 0.6490161736539296, 0.8836969583905716, 0.8168197078054455, 0.05814141878980328, 0.3806881621307814, 0.18767136036053766, 0.13866884946206703, 0.7272233711028963, 0.417527517705913, 0.12878816642043855, 0.7613927806633893, 0.671147870265287, 0.6762369173316182, 0.3682317031276586, 0.9001829777718318, 0.9206586127612758, 0.670863021650685, 0.0026923205813963458, 0.6167001380557525, 0.5378494670570113, 0.3496141384092558, 0.7310510133558111, 0.7971370098809432, 0.2791096044426712, 0.6683072857409992, 0.26766840173686834, 0.5768276554503415, 0.20476043956866086, 0.5820168017564684, 0.1064753870391485, 0.9869247952788052, 0.3034067014984354, 0.38961124313766193, 0.966189982728462, 0.7513550983343424, 0.019488978357059983, 0.8083198628028503, 0.7429937752336099, 0.5965644618891279, 0.3323515974168736, 0.24589127074606776, 0.22067707071006815, 0.28581974933983845, 0.9065049359190113, 0.2660897347124205, 0.8631745524744999, 0.09344115728010816, 0.19955369203669537, 0.587141912671339, 0.8050497909333733, 0.3226030355150331, 0.13005981901139907, 0.28707249909178534, 0.476465205217827, 0.5041960541799165, 0.9118641493367816, 0.4119373734309505, 0.9373659956811311, 0.6424277924882911, 0.9128001452277108, 0.08911611643293005, 0.7763830990412988, 0.07232263287111329, 0.4096000174378708, 0.4917390076009832, 0.3231334835235191, 0.8848703121665539, 0.5212145311858138, 0.6938334646309621, 0.12998548252622477, 0.720063286180853, 0.12224509177055198, 0.08867614027492854, 0.5282454584514348, 0.24386666182499395, 0.8554868851960272, 0.47896803991030645, 0.646130170389925, 0.7524369157933459, 0.13029430154430477, 0.15807592296962625, 0.5717926413413618, 0.8490496270358431, 0.3449077554319122, 0.8568525395154251, 0.23018416441850176, 0.2926638945821557, 0.7503415918058454, 0.547085285284568, 0.8218197697894164, 0.05317022464460697, 0.882964573267071, 0.7091620683006035, 0.9706435148488264, 0.35399013937951607, 0.49730765650994313, 0.3755381735701777, 0.5601751847726968, 0.5300366133689036, 0.46506559862110664, 0.8339003247360844, 0.7231530708980637, 0.6914085249932755, 0.5451709969264191, 0.5687085358938563, 0.8162976569127831, 0.2259232327574756, 0.1984567675042347, 0.7100977931648093, 0.5166517824800108, 0.36673032891646895, 0.8271032031184371, 0.012479939773526683, 0.11593992826606381, 0.8972423461242105, 0.706284115852577, 0.6850623693865118, 0.409620561288652, 0.006954681133577556, 0.3878612170795638, 0.4005510433882772, 0.9083126599314281, 0.654252549522321, 0.8498605035675798, 0.5832224857337129, 0.2807626009117504, 0.44601438804408344, 0.11564947939125092, 0.9401521806245573, 0.30977593682297566, 0.0003064108530598242, 0.5174922333915138, 0.036716685566471674, 0.6176820551489804, 0.6625080043747225, 0.6213446117057876, 0.7113030636912471, 0.6568446924642343, 0.3234979283413788, 0.23206088253469437, 0.5035980951974227, 0.6557017001599165, 0.46687291257093255, 0.35563986041801, 0.41851137117568527, 0.11106101403065116, 0.21845477900701937, 0.6078795914262629, 0.9791696894974672, 0.5762909034937058, 0.5984836597217797, 0.8142800462335252, 0.7721918750246897, 0.7989549241983351, 0.16997978666414293, 0.5444970024833524, 0.5910541671274723, 0.1778167805743991, 0.14527769394852186, 0.8010184609597203, 0.003491284977071518, 0.9657278233564698, 0.5716447180704363, 0.6601351116308537, 0.9017646676510067, 0.06793223691447259, 0.20871080403758824, 0.09354408454815866, 0.5561927825592995, 0.19620705153323437, 0.042193311637001685], [0.23232658848588217, 0.24480780937190694, 0.5935402235532703, 0.01833962326850036, 0.6574224118189014, 0.3372036696267777, 0.1354768782749931, 0.1824747698878556, 0.18613897400622736, 0.8112042914820126, 0.2768192214144408, 0.9461835937216391, 0.26166193789219416, 0.6551563331420882, 0.08020170029871532, 0.4878559230240507, 0.04037970022854165, 0.41796213366523716, 0.19890232783127004, 0.15803212078517292, 0.3642651394419133, 0.8029832902921943, 0.5073281473856519, 0.23913697272584067, 0.21378262828536831, 0.3983584149218635, 0.31919157639845186, 0.4035882677920558, 0.6909015191634258, 0.09460775306594316, 0.7831412436935258, 0.4182014845996699, 0.21458464613116357, 0.7502141444682089, 0.148390394868266, 0.40012382061779894, 0.2970454494261391, 0.7348374934991658, 0.5728588143531036, 0.818299112721712, 0.0045820537053078425, 0.4607760212797086, 0.17776918600616165, 0.7100139467694684, 0.1978113233444827, 0.6637407053477059, 0.05270186566941648, 0.17333015088731585, 0.5734783839784018, 0.4074395217704748, 0.808666850954399, 0.3099102560081939, 0.2059114730145417, 0.14137842999402106, 0.39568485952106003, 0.9123631718603955, 0.20758698622836014, 0.6441797839342437, 0.2005032962202492, 0.09994733529582112, 0.8999546268497858, 0.8000033575310467, 0.5851555849084845, 0.9599906020513089, 0.8420654232736444, 0.548082734527756, 0.586093512661564, 0.9566591003122288, 0.9128621428531712, 0.3721219777502297, 0.7331430298894251, 0.788824503806341, 0.6614361157507985, 0.20934647139872553, 0.9693051871509837, 0.36440098940950194, 0.7144887313509847, 0.9071463447573954, 0.7326733789428128, 0.7688094944169047, 0.9468097401081104, 0.21992203812966038, 0.48936232018464954, 0.9745703660838316, 0.5962716806532335, 0.3897384809198332, 0.5875495485359326, 0.67569376572288, 0.4164976217370129, 0.07234810333964414, 0.3640799746352993, 0.6838953037729443, 0.9155598544604755, 0.43697868765106085, 0.6670043516650618, 0.8018208887660959, 0.08026213555111927, 0.47397757845315747, 0.48471639985894543, 0.7675007481801934, 0.4595411499236146, 0.027800529138581553, 0.02474912182381439, 0.339544270426281, 0.07307061896667921, 0.15509487680060718, 0.26026429291031605, 0.4086909130127989, 0.6949362926338165, 0.6897735268336623, 0.1799654542026936, 0.6577025883576655, 0.28344316903444755, 0.18787038967883318, 0.45902833572183843, 0.3610170532768411, 0.9820422935065205, 0.7231236310283302, 0.24478680089443228, 0.13744390289940633, 0.8899046283198987, 0.5779466483693704, 0.5357668353331503, 0.670505715861847, 0.1809412965449393, 0.5816883169355372, 0.5665453014257905, 0.3312620360488904, 0.44735392816291575, 0.18208774825582308, 0.5906964320864931, 0.040334514688136314, 0.40250059434652397, 0.5310205291246501, 0.6953865171181138, 0.5874087734754516, 0.09743328625013192, 0.5761014546060163, 0.7559167538196813, 0.6108387665653636, 0.6531640180180679, 0.7518202836696585, 0.7236698314605161, 0.7004907440340361, 0.5667519951428431, 0.6541673951007122, 0.6166831353242825, 0.3539395517141196, 0.24850823912769437, 0.2789747919831399, 0.02593307554961033, 0.4446558986310535, 0.6226170466369029, 0.6864215177211013, 0.889399861945638, 0.9353978107575007, 0.3032698984596892, 0.28730308729593435, 0.49105768842391595, 0.28877454157562643, 0.08148483663492245, 0.10807984852266417, 0.16191791426472857, 0.6770173531837934, 0.1802323047913985, 0.9184756016982315, 0.07989417108658092, 0.26378735530105624, 0.22748589579122802, 0.3460303188979327, 0.9790969898592753, 0.011566987368520132, 0.46249859067537247, 0.580884032342603, 0.520344257208124, 0.14839199584309304, 0.7601275845718894, 0.7734302674814327, 0.617735052188187, 0.6785698951732944, 0.16179857866287206, 0.736200931785267, 0.2625968967759651, 0.9882782990408097, 0.9408454991719467, 0.25630714011860967, 0.5660446896256176, 0.10526559900391819, 0.5398396928024665, 0.3664535683856066, 0.7704334971389932, 0.9070103949687838, 0.5061154278540773, 0.652290745522388, 0.932506823014088, 0.8616965675231102, 0.6018175365016775, 0.5387070382377891, 0.5018261557012197, 0.8847734457070335, 0.02474766872842782, 0.4754148034616609, 0.5867167800479893, 0.8415780441870256, 0.7307390318372532, 0.25073828391468, 0.7021922367794639, 0.8857173589888844, 0.20840538052127255, 0.45865295654804605, 0.40460415067252486, 0.3305531624884517, 0.1577495393324687, 0.777481328915954, 0.06944348132536127, 0.8147661799287833, 0.051344772866106836, 0.737735947322025, 0.08904940126962813, 0.18420750915873818, 0.7363146497800331, 0.9935191693812042, 0.49509213483755155, 0.20846531930684697, 0.05268530520398462, 0.06322302980213657, 0.23715736897681994, 0.33521641709273875, 0.9375994886812675, 0.3328999352149915, 0.3888281965768632, 0.2275940616140144, 0.11478312914854594, 0.05393806851672156, 0.7361219707462876, 0.9977261599183469, 0.10195193565421723, 0.783404441404674, 0.10755599014269057, 0.5984709454440944, 0.5029495688436033, 0.17579099542374166, 0.03072935350809991, 0.5929783257796035, 0.33480004112104, 0.8668770923780094, 0.05072017103236659, 0.23810963956364073, 0.6759496993515081, 0.9632862798001334, 0.11566367742949102, 0.04226479593920196, 0.2419428047053338, 0.16180700754762212, 0.4531791345183185, 0.7376054915863502], [0.6980343435083627, 0.5511842073365197, 0.628669381684252, 0.44103868206581287, 0.906220851146999, 0.4272503926318647, 0.5407948773480259, 0.06948409738017192, 0.10571535099185991, 0.10577453629542455, 0.5149056543988524, 0.845520021529215, 0.003906755134709172, 0.21259665752772483, 0.3008644218318024, 0.7283603731184914, 0.9727983567785792, 0.40265126389329875, 0.5542275324631084, 0.9784189747558842, 0.327693581313817, 0.4204465931415403, 0.9418619963297152, 0.23506694381882276, 0.48884923415623305, 0.4696229001779818, 0.7161492112102164, 0.856687842872986, 0.38757881608883227, 0.03263815303739137, 0.6116461180864312, 0.21415425572022528, 0.09521045544475559, 0.2887313557433213, 0.12019567164167855, 0.13127476057541765, 0.5872137211999695, 0.2912012385767705, 0.3570291952571367, 0.9233379398533416, 0.9086567728727113, 0.8812219667803772, 0.009720424436771458, 0.7716363136198994, 0.685439135165912, 0.8292349023882293, 0.1742297684238029, 0.14698000512678566, 0.10963456428141671, 0.7783407692717994, 0.04525627930152054, 0.05303410510889561, 0.4762064029415787, 0.4042731344983135, 0.6834149207114513, 0.1772391148877882, 0.7942413134040459, 0.5995640593358006, 0.621806282592721, 0.37425622200099196, 0.6969610833310433, 0.02359938520897309, 0.8786732816384656, 0.9401061761431513, 0.8735308014919141, 0.08744520735841343, 0.9540176240527838, 0.39119366143549494, 0.4773644950446295, 0.13662195672626554, 0.5598035792127449, 0.7393730719383237, 0.6944300269897756, 0.21999796970740348, 0.7757364962180224, 0.9667876977506038, 0.08435318787682222, 0.330703226934399, 0.5862178012961186, 0.8928869023590509, 0.2926396015924889, 0.4386730243659913, 0.43913113130096226, 0.06401941819693369, 0.00040827127466702695, 0.6410712717971575, 0.5483284724176297, 0.3869350126033041, 0.8124789670609551, 0.6919630158769354, 0.11709858757508618, 0.7421119418437278, 0.9443510177428688, 0.2693432464619471, 0.6587206174828271, 0.6282558982516984, 0.7606381634222528, 0.15650824211721026, 0.018008744661859755, 0.06856804673718653, 0.8956312504691993, 0.3309941967261446, 0.5761755274661425, 0.3073986675518121, 0.30967615467112597, 0.7336457866415586, 0.5380877240054264, 0.959922374833758, 0.019522554605620912, 0.6102765872195053, 0.6400803352260331, 0.5991403920248456, 0.9279489937358459, 0.800912888484483, 0.4868543909651323, 0.11178194897083416, 0.9231119401465961, 0.29760001405034897, 0.4458137299534898, 0.8870352656645836, 0.017483061819069, 0.7361286836786506, 0.9349549238497136, 0.5844389278584179, 0.932235264447066, 0.8223443441476919, 0.45888836850211967, 0.31647848539336343, 0.35426309992880756, 0.18451711422952843, 0.9134826330766974, 0.7058756589879577, 0.42423373429506817, 0.1741064119761605, 0.8703521202717476, 0.9181534949233755, 0.5598921342040805, 0.40472327558146115, 0.5053468514581958, 0.6650624482336753, 0.41195863721405257, 0.24315589686595418, 0.9307891989081175, 0.22444822016826305, 0.011781697722531459, 0.7678798938874394, 0.5621861901144526, 0.6794254312869342, 0.670573782759106, 0.2695312100328242, 0.9188171816130565, 0.5638873515695834, 0.30402388095586885, 0.6129128946886728, 0.2602753815937805, 0.6841259399795716, 0.7748478628863925, 0.45863414533484625, 0.22318085859062442, 0.16170836673669864, 0.32068821708592155, 0.7714879052824289, 0.5819130811439847, 0.17865275302521522, 0.3640855725138272, 0.28996849232755395, 0.8027249487155628, 0.28590867736820735, 0.5168255672053437, 0.08834155680596001, 